# Brewfile - Modern Development Environment
# Install with: brew bundle

# Taps
tap "homebrew/bundle"
tap "homebrew/services"

# Core Tools
brew "git"
brew "neovim"
brew "tmux"
brew "starship"  # Fast prompt

# Modern Shell Tools
brew "eza"       # Better ls
brew "bat"       # Better cat
brew "fd"        # Better find
brew "ripgrep"   # Better grep
brew "fzf"       # Fuzzy finder
brew "zoxide"    # Better cd
brew "delta"     # Better git diff

# Development Tools
brew "fnm"       # Fast Node.js manager
brew "pyenv"     # Python version manager
brew "rustup"    # Rust toolchain
brew "go"        # Go language

# Language Servers
brew "lua-language-server"
brew "yaml-language-server"
brew "typescript-language-server"
brew "gopls"

# Utilities
brew "jq"        # JSON processor
brew "htop"      # Process viewer
brew "tree"      # Directory viewer
brew "wget"      # Downloader
brew "gh"        # GitHub CLI

# Optional but useful
brew "lazygit"   # Git UI
brew "glow"      # Markdown viewer
brew "hyperfine" # Benchmarking

# Casks (GUI Apps)
cask "alacritty" # Terminal emulator

# Fonts
cask "font-jetbrains-mono-nerd-font"